In [2]:
from datetime import datetime
import mysql.connector

In [3]:
mydb = mysql.connector.connect(host="localhost", 
                               user="root", 
                               passwd="root",
                               auth_plugin = 'mysql_native_password',
                               database = "talent_referral_payout")

In [5]:
mycursor = mydb.cursor()
#mycursor.execute("CREATE DATABASE testdatabase")

In [6]:
Q1 = "SELECT DISTINCT cost_center FROM trp_payment_report_sample"

In [7]:
mycursor.execute(Q1)

In [8]:
for x in mycursor:
    print(x)

(180009236,)
(180002098,)
(180002097,)
(180002099,)
(180008731,)
(110043853,)
(180004383,)
(180004787,)
(180043300,)
(180006560,)
(180008772,)
(180043000,)

In [9]:
Q2 = "SELECT referral_name,rms_id FROM trp_payment_report_sample WHERE cost_center=180004787"

In [10]:
mycursor.execute(Q2)

In [11]:
for x in mycursor:
    print(x)

('Horne Edward', 22084994)
('Kaitlin Zinkand ', 7749363)
('Nguyen Linda', 14326759)
('Gibbs Kevin', 22063678)
('Alex Chun ', 21774962)
('Christiansen Hannah', 22282340)
('Cole Danielle', 22218364)
('Cearley Madison', 22222711)
('Jagneaux Anna', 22200550)
('Ramos Kaylin', 22199097)
('Jones Brionna ', 22288085)
('Caitlin Weaver ', 22276846)
('Amous Nasser', 22242151)
('Gabriel A. Ruiz', 19593714)

In [32]:
print("Please enter your employee number")
user_input = input()

Please enter your employee number
250194

In [13]:
print(user_input)

250194

In [46]:
type(user_input)

str

In [33]:
Q3 = "SELECT referral_name,amount,date_of_origin FROM trp_payment_report_sample WHERE emp_num = "+ user_input

In [34]:
print(Q3)

SELECT referral_name,amount,date_of_origin FROM trp_payment_report_sample WHERE emp_num = 250194

In [42]:
mycursor.execute(Q3)

In [36]:
for x in mycursor:
    print(x)

('Blair Katelyn', 2000, '6/15/2018')

In [43]:
myresult = mycursor.fetchone()

In [44]:
print(myresult)

('Blair Katelyn', 2000, '6/15/2018')

In [45]:
type(myresult)

tuple

In [70]:
mycursor.execute("INSERT INTO Test (name, created, gender) VALUES(%s,%s,%s)", ("Tim", datetime.now(), "M"))
mydb.commit()

In [71]:
mycursor.execute("DESCRIBE Test")

In [72]:
for x in mycursor:
    print(x)

('name', b'varchar(50)', 'NO', bytearray(b''), None, '')
('created', b'datetime', 'NO', bytearray(b''), None, '')
('gender', b"enum('M','F','O')", 'NO', bytearray(b''), None, '')
('ID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')

In [73]:
mycursor.execute("INSERT INTO Test (name, created, gender) VALUES(%s,%s,%s)", ("Joe", datetime.now(), "F"))
mydb.commit()

In [82]:
mycursor.execute("INSERT INTO Test (name, created, gender) VALUES(%s,%s,%s)", ("KADALI", datetime.now(), "M"))
mydb.commit()

In [83]:
mycursor.execute("INSERT INTO Test (name, created, gender) VALUES(%s,%s,%s)", ("PRANI", datetime.now(), "F"))
mydb.commit()

In [86]:
mycursor.execute("DESCRIBE Test")

In [94]:
mycursor.execute("ALTER TABLE Test CHANGE name first_name VARCHAR(50)")

In [95]:
mycursor.execute("DESCRIBE Test")

In [96]:
for x in mycursor:
    print(x)

('first_name', b'varchar(50)', 'YES', bytearray(b''), None, '')
('created', b'datetime', 'NO', bytearray(b''), None, '')
('gender', b"enum('M','F','O')", 'NO', bytearray(b''), None, '')
('ID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('food', b'varchar(50)', 'NO', bytearray(b''), None, '')

In [84]:
mycursor.execute("DESCRIBE Person")

In [85]:
for x in mycursor:
    print(x)

('name', b'varchar(50)', 'YES', bytearray(b''), None, '')
('age', b'smallint unsigned', 'YES', bytearray(b''), None, '')
('personID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')

In [88]:
mycursor.execute("SELECT id, name FROM Test WHERE gender = 'M' ORDER BY ID DESC")

In [89]:
for x in mycursor:
    print(x)

(4, 'KADALI')
(2, 'Tim')
(1, 'Tim')

In [90]:
mycursor.execute("ALTER TABLE Test ADD COLUMN food varchar(50) NOT NULL")

In [91]:
mycursor.execute("DESCRIBE Test")

In [93]:
for x in mycursor:
    print(x)

('created', b'datetime', 'NO', bytearray(b''), None, '')
('gender', b"enum('M','F','O')", 'NO', bytearray(b''), None, '')
('ID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('food', b'varchar(50)', 'NO', bytearray(b''), None, '')

In [42]:
mycursor.execute("INSERT INTO Person (name, age) VALUES(%s, %s)", ("Tim", 19))
mydb.commit()

In [45]:
mycursor.execute("INSERT INTO Person (name, age) VALUES(%s, %s)", ("Joe", 29))
mydb.commit()

In [46]:
mycursor.execute("SELECT * FROM Person")

In [47]:
for x in mycursor:
    print(x)

('Tim', 19, 1)
('Joe', 29, 2)